posts/Emacs/mani.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>mani.el: Yet Another Emacs Package to Read Man Page</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">mani.el: Yet Another Emacs Package to Read Man Page</h1>
<p>
<a href="https://github.com/Raphus-cucullatus/mani.el">mani.el</a> is a tiny Man<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup> page reader for Emacs.
</p>


<div id="outline-container-orgbcc0c69" class="outline-2">
<h2 id="orgbcc0c69">"Why not <code>man.el</code><sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup> or <code>woman.el</code><sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup>"?</h2>
<div class="outline-text-2" id="text-orgbcc0c69">
<p>
<b><code>man.el</code> does not support viewing remote Man pages.</b> Recently I've
found myself programming frequently in a remote environment: a remote
machine (usually Linux), from a macOS laptop.  In this case, I prefer
seeing Man pages in that machine, e.g. Linux system calls instead of
BSD ones, and tools installed on servers not on my laptop.
</p>

<p>
One can manage <code>woman.el</code> to find remote man page file<sup><a id="fnr.4" class="footref" href="#fn.4">4</a></sup>, but
<b><code>woman.el</code> does not always parse correctly.</b> For example, "<code>woman
ls</code>" produces the following sequences in my machine:
</p>

<pre class="example">
.Dd May 19, 2002
.Dt LS 1
.Os
.Sh NAME
.Nm ls
.Nd list directory contents
...
</pre>
</div>
</div>

<div id="outline-container-org35befeb" class="outline-2">
<h2 id="org35befeb"><code>mani.el</code> is a "just-work" Man page reader</h2>
<div class="outline-text-2" id="text-org35befeb">
<ol class="org-ol">
<li>It invokes the <code>man</code> program to produce the content.  So if <code>man</code>
works, <code>mani.el</code> works.</li>

<li>It uses <code>process-file</code> to run the <code>man</code> program.  So it is
"remote-aware".  If the current <code>default-directory</code> is a remote one,
<code>man</code> is invoked in that remote machine.</li>
</ol>
</div>
</div>


<div id="outline-container-org2b66e96" class="outline-2">
<h2 id="org2b66e96">Limitations</h2>
<div class="outline-text-2" id="text-org2b66e96">
<p>
<code>mani.el</code> is not any feature-rich like <code>man.el</code> and <code>woman.el</code>.  It
does not support navigation, completion, highlight, and caching
functionalities.  I find it just work, and am less-motivated to push
it further.
</p>

<p>
You can contact me <a href="https://github.com/Raphus-cucullatus/mani.el/issues">here</a> if you have any questions.  Hope you enjoy it!
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="https://en.wikipedia.org/wiki/Man_page">https://en.wikipedia.org/wiki/Man_page</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
<a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/Man-Page.html#Man-Page">https://www.gnu.org/software/emacs/manual/html_node/emacs/Man-Page.html#Man-Page</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara"><p class="footpara">
<a href="https://www.gnu.org/software/emacs/manual/html_node/woman/index.html">https://www.gnu.org/software/emacs/manual/html_node/woman/index.html</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4">4</a></sup> <div class="footpara"><p class="footpara">
<a href="https://emacs.stackexchange.com/a/20996/19670">https://emacs.stackexchange.com/a/20996/19670</a>
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="date">Date: Feb 21, 2020</p>
</div>
</body>
</html>
